{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, slot settings, pricing rules, and slot blocking with admin-only mutations.",
  "feature_evidence.json": "Feature evidence report linking a frontend admin login update to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing routing, auth, booking flows, admin tools, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry file mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines the app router, routes, and providers including admin-protected routes and global theming.",
  "frontend/src/components/admin/AdminBookingCalendar.tsx": "Admin calendar component showing daily slot status with booking and block state derived from queries.",
  "frontend/src/components/admin/BlockSlotsDialog.tsx": "Dialog component allowing admins to block or unblock individual slots with reason input and mutations.",
  "frontend/src/components/admin/EarningsTracker.tsx": "Displays daily and weekly earnings based on a selected date using query hooks and date picker UI.",
  "frontend/src/components/admin/PricingRulesForm.tsx": "Provides a form to view and update pricing rules with validation and backend syncing.",
  "frontend/src/components/admin/SlotSettingsForm.tsx": "Form for configuring opening hours and slot duration with validation and update mutations.",
  "frontend/src/components/auth/AccessRestrictedScreen.tsx": "Shows an access denied screen for non-admin users with navigation back to booking.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles customer login/logout via Internet Identity with status indicators.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards admin routes by enforcing authentication, admin checks, and profile setup.",
  "frontend/src/components/customer/AvailableSlotsList.tsx": "Renders available time slots with formatted times, prices, and slot selection.",
  "frontend/src/components/customer/BookingForm.tsx": "Form component that collects user details, validates authentication, and submits a booking using backend mutations.",
  "frontend/src/components/customer/BookingSummary.tsx": "Displays a read‑only summary of booking details including date, time, sport, and price.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout providing header, navigation, footer, and routing outlet with authentication-aware navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity management, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend features like user profiles, admin checks, and ownership actions.",
  "frontend/src/index.css": "Tailwind setup plus dark-mode themed CSS variables for the app’s visual style.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for calendar management, slot settings, pricing rules, and earnings tracking.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin authentication, ownership claiming, and redirects based on admin status.",
  "frontend/src/pages/customer/BookingConfirmationPage.tsx": "Displays booking confirmation details, including date, time, and booking ID, with error handling for missing bookings.",
  "frontend/src/pages/customer/CustomerBookingPage.tsx": "Lets users select a date, view available slots, and proceed with booking using pricing rules.",
  "frontend/src/pages/customer/PaymentPlaceholderPage.tsx": "Shows a placeholder payment screen and allows users to continue to booking confirmation.",
  "frontend/src/pages/customer/ReceiptLookupPage.tsx": "Provides a form for users to enter a booking ID and navigate to its confirmation page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and including typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing the full‑stack app goals, architecture, issues, and existing implemented features for SportsVilla NXT GEN turf management."
}