{
  "backend/main.mo": "Motoko backend providing user profile storage, slot settings, pricing rules, and blocked-slot management with admin authorization checks.",
  "feature_evidence.json": "JSON report mapping implemented frontend features to source files, components, and requirement IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in routing, UI, booking, admin tools, and styling.",
  "frontend/index.css": "Global Tailwind-based styling defining color variables, themes, and base layout rules.",
  "frontend/index.html": "App HTML entry with favicon, title, root container, and script loader.",
  "frontend/src/App.tsx": "Root React app configuring routing, themes, and global providers for the booking and admin interfaces.",
  "frontend/src/components/admin/AdminBookingCalendar.tsx": "Admin calendar showing daily slot availability, booked and blocked slots, with date selection and refresh controls.",
  "frontend/src/components/admin/BlockSlotsDialog.tsx": "Provides a dialog to block or unblock a time slot with optional reason input and async mutation handlers.",
  "frontend/src/components/admin/EarningsTracker.tsx": "Displays daily and weekly earnings based on a selected date using earnings query hooks.",
  "frontend/src/components/admin/PricingRulesForm.tsx": "Shows and updates pricing rules for weekdays and weekends with form validation and mutation.",
  "frontend/src/components/admin/SlotSettingsForm.tsx": "Form for configuring opening hours and slot duration with validation and update mutation.",
  "frontend/src/components/auth/AccessRestrictedScreen.tsx": "Shows an access restricted message and a button to return to the booking page.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and error handling.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Gatekeeper component enforcing login, profile completion, and admin status before rendering children.",
  "frontend/src/components/customer/AvailableSlotsList.tsx": "Displays available hourly slots with formatted time and price, allowing users to select a slot.",
  "frontend/src/components/customer/BookingForm.tsx": "Handles booking creation with user details, authentication flow, and form submission to create a booking.",
  "frontend/src/components/customer/BookingSummary.tsx": "Shows a summary card of the selected date, time, sport, and total price before booking completion.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, navigation, footer, and route outlet, adapting UI for customer or admin routes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, identity loading, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend API interactions in React Query hooks for profiles, settings, pricing, blocked slots, bookings, and admin checks.",
  "frontend/src/index.css": "Tailwind base styles with custom dark-theme variables and utility layers for the application's visual design.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, then renders App into the root element.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides an admin dashboard with tabs for calendar management, slot settings, pricing rules, and earnings tracking.",
  "frontend/src/pages/customer/BookingConfirmationPage.tsx": "Displays confirmation details for a specific booking, including date, time, and status, with loading and error handling.",
  "frontend/src/pages/customer/CustomerBookingPage.tsx": "Allows customers to select a date, view available slots, calculate pricing, and proceed with booking through a form.",
  "frontend/src/pages/customer/PaymentPlaceholderPage.tsx": "Shows a placeholder payment page with upcoming payment method info and routes users to booking confirmation.",
  "frontend/src/pages/customer/ReceiptLookupPage.tsx": "Provides a form for users to enter a booking ID and navigate to its confirmation page.",
  "frontend/src/utils/urlParams.ts": "Utility for extracting, storing, retrieving, and clearing URL parameters, with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography and container queries.",
  "project_state.json": "Defines project state for a full‑stack turf‑booking app, including architecture notes, image requirements, and a list of existing admin and customer features. Contains metadata like schema version, project state version, and planned functionality for scheduling, pricing, and access control."
}