{
  "backend/main.mo": "Motoko canister managing user profiles, slot settings, pricing, and blocked slots with strict owner-based admin authorization.",
  "backend/migration.mo": "Migration module returning the previous actor state unchanged.",
  "feature_evidence.json": "Feature evidence report describing the emergency ownership reset UI addition and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files and their roles in the app.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, themes, and global providers.",
  "frontend/src/components/admin/AdminBookingCalendar.tsx": "Admin calendar view generating daily slots and displaying booking/blocked statuses.",
  "frontend/src/components/admin/BlockSlotsDialog.tsx": "Dialog allowing admins to block or unblock a slot with reason input and mutations.",
  "frontend/src/components/admin/EarningsTracker.tsx": "Displays daily and weekly earnings based on a selectable date, fetching data via hooks and rendering revenue and booking counts.",
  "frontend/src/components/admin/EmergencyOwnershipResetCard.tsx": "Provides a form for entering an emergency reset code to trigger an ownership reset using a mutation hook.",
  "frontend/src/components/admin/PricingRulesForm.tsx": "Loads pricing rules, allows editing weekday/weekend rates and floodlight hour, and saves updates via a mutation.",
  "frontend/src/components/admin/SlotSettingsForm.tsx": "Fetches slot settings and provides a form to update opening/closing times and slot duration with validation.",
  "frontend/src/components/auth/AccessRestrictedScreen.tsx": "Shows an access‑restricted message for non-admin users with a button to return to the booking page.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and clears cached queries on logout.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Ensures a user is authenticated and an admin, redirecting otherwise and prompting for profile setup when needed.",
  "frontend/src/components/customer/AvailableSlotsList.tsx": "Displays available hourly slots with formatted time and price, allowing users to select a slot. Shows a fallback message when no slots exist.",
  "frontend/src/components/customer/BookingForm.tsx": "Collects customer details and submits a booking after authentication, using slot settings and navigation to the payment page. Manages form validation and Internet Identity login flow.",
  "frontend/src/components/customer/BookingSummary.tsx": "Shows a read‑only summary of the user's chosen date, time, sport, and total price. Used to review booking details before confirmation.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, navigation, footer, and routed content. Handles route-type detection and admin/customer navigation logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refreshing dependent queries on change. Supports authenticated and anonymous actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context for login, identity loading, and status tracking using Dfinity AuthClient. Exposes helper flags and functions for authentication state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, ownership actions, and other backend interactions using the actor. Includes mutation helpers with error handling and cache invalidation.",
  "frontend/src/index.css": "Configures Tailwind and defines light/dark theme CSS variables with a neon-accent dark mode.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for calendar, settings, and earnings components.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin authentication, ownership claiming, and redirects using Internet Identity and related queries.",
  "frontend/src/pages/customer/BookingConfirmationPage.tsx": "Displays booking confirmation details, formatting date and time and handling loading or missing bookings.",
  "frontend/src/pages/customer/CustomerBookingPage.tsx": "Lets customers select a date, view available slots, calculate prices, and proceed to booking.",
  "frontend/src/pages/customer/PaymentPlaceholderPage.tsx": "Shows a temporary payment info page with supported methods and routes to confirmation.",
  "frontend/src/pages/customer/ReceiptLookupPage.tsx": "Provides a form for users to enter a booking ID and navigate to the receipt page.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), store them in sessionStorage, retrieve persisted values, and clear them.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project state and feature requests related to adding emergency ownership reset functionality and tightening admin authorization after reset."
}