{
  "backend/main.mo": "Motoko actor managing user profiles, slot settings, pricing rules, and admin‑protected slot blocking with access control integration.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and tests with high confidence flags.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing components, pages, hooks, and layout behavior.",
  "frontend/index.css": "Global Tailwind and theme variable definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring router, theme, React Query provider, and global error boundary.",
  "frontend/src/components/admin/AdminBookingCalendar.tsx": "Admin calendar showing bookings, blocked slots, and slot details with date selection and data fetching.",
  "frontend/src/components/admin/BlockSlotsDialog.tsx": "Dialog allowing admins to block or unblock slots with reason input and mutation handling.",
  "frontend/src/components/admin/EarningsTracker.tsx": "Displays daily and weekly earnings for a selected date using date pickers and earnings query hooks.",
  "frontend/src/components/admin/EmergencyOwnershipResetCard.tsx": "Provides a form to reset ownership using an emergency code with validation and mutation handling.",
  "frontend/src/components/admin/PricingRulesForm.tsx": "Fetches and updates pricing rules, allowing admins to edit rates and floodlight hours via a form.",
  "frontend/src/components/admin/SlotSettingsForm.tsx": "Manages slot timing settings, enabling updates to opening hours, closing hours, and slot duration.",
  "frontend/src/components/auth/AccessRestrictedScreen.tsx": "Renders an access restriction message for non-admin users with navigation back to the booking page.",
  "frontend/src/components/auth/LoginButton.tsx": "Toggles user authentication through Internet Identity, handling login, logout, and loading states.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards admin routes by enforcing authentication, admin checks, and user profile completion.",
  "frontend/src/components/customer/AvailableSlotsList.tsx": "Renders a list of available time slots with formatted time and price, allowing users to select a slot.",
  "frontend/src/components/customer/BookingForm.tsx": "Displays a booking form that gathers user details, handles authentication, and submits booking requests.",
  "frontend/src/components/customer/BookingSummary.tsx": "Shows a summary card with selected date, time, sport, and total price before confirmation.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, navigation, footer, and route outlet handling user/admin navigation.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Implements an error boundary that displays an error message and reload option when the app crashes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login handling, and context setup.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profiles, admin checks, ownership actions, and booking-related data.",
  "frontend/src/index.css": "Defines Tailwind layers and custom light/dark theme CSS variables with a neon-accent dark mode.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for calendar, settings, and earnings management.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin authentication, ownership claiming, and redirects based on admin status.",
  "frontend/src/pages/customer/BookingConfirmationPage.tsx": "Displays booking confirmation details or errors based on booking ID lookup.",
  "frontend/src/pages/customer/CustomerBookingPage.tsx": "Lets customers pick a date, view available slots, calculate pricing, and book a timeslot.",
  "frontend/src/pages/customer/PaymentPlaceholderPage.tsx": "Shows a placeholder explaining upcoming payment integration and leads to confirmation.",
  "frontend/src/pages/customer/ReceiptLookupPage.tsx": "Allows users to enter a booking ID and navigate to the receipt/confirmation page.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the current project state, including feature requests and configuration for implementing an emergency ownership reset code set to 73024141."
}