{
  "backend/main.mo": "Main Motoko actor handling user profiles, slot settings, pricing rules, blocked slots, and admin authorization through AccessControl and custom owner checks.",
  "backend/migration.mo": "Migration module converting old ownership structure to new multi-owner format by mapping old state into a List-based owners field.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected frontend files, involved components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each key frontend file including components, hooks, pages, and styles.",
  "frontend/index.css": "Global Tailwind-based theme setup defining light and dark color variables and base styling tokens.",
  "frontend/index.html": "HTML entry point mounting the root React app and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React setup configuring router routes, React Query provider, theme provider, and global error boundary.",
  "frontend/src/components/admin/AdminBookingCalendar.tsx": "Admin calendar component showing daily slots with booked/blocked status, using backend queries to manage and display slot info.",
  "frontend/src/components/admin/AdminOwnersCard.tsx": "UI card to view, add, and remove admin owners with principal validation and confirmation dialogs.",
  "frontend/src/components/admin/BlockSlotsDialog.tsx": "Dialog to block or unblock a time slot with optional reason input and mutation handling.",
  "frontend/src/components/admin/EarningsTracker.tsx": "Displays daily and weekly earnings based on a selected date using earnings query hooks.",
  "frontend/src/components/admin/EmergencyOwnershipResetCard.tsx": "Form for triggering an emergency ownership reset using a reset code with validation and warnings.",
  "frontend/src/components/admin/PricingRulesForm.tsx": "Form for viewing and updating pricing rules for various time periods with validation.",
  "frontend/src/components/admin/SlotSettingsForm.tsx": "Form to configure opening hours and slot durations with validation and update mutations.",
  "frontend/src/components/auth/AccessRestrictedScreen.tsx": "Displays an admin-only access restriction screen with a button redirecting users to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and automatic session handling.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Protects admin routes by enforcing authentication, checking admin status, prompting profile setup, and handling redirects and loading states.",
  "frontend/src/components/customer/AvailableSlotsList.tsx": "Shows available booking slots with formatted times and prices, allowing users to select a slot.",
  "frontend/src/components/customer/BookingForm.tsx": "Handles customer booking form input, validates data, triggers booking creation, and redirects to payment.",
  "frontend/src/components/customer/BookingSummary.tsx": "Displays a summary of booking details including date, time, sport, and total price.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, navigation, footer, route-aware navigation styling, and background pattern.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Wraps the app in an error boundary that shows an error screen with reload option when exceptions occur.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing login state, identity loading, and AuthClient initialization.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, ownership actions, and other backend actor interactions.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines a dark-themed design system with custom color variables.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for calendar, settings, and earnings, including related forms and components.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin authentication via Internet Identity, ownership claiming, and redirects based on admin status.",
  "frontend/src/pages/customer/BookingConfirmationPage.tsx": "Displays booking confirmation details, loading states, and fallback UI when a booking is not found.",
  "frontend/src/pages/customer/CustomerBookingPage.tsx": "Customer booking UI that selects a date, checks availability, shows slots, calculates pricing, and displays a booking form.",
  "frontend/src/pages/customer/PaymentPlaceholderPage.tsx": "Placeholder payment page showing upcoming payment methods and routing users to booking confirmation.",
  "frontend/src/pages/customer/ReceiptLookupPage.tsx": "Form page allowing users to enter a booking ID and navigate to its confirmation/receipt.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata describing features, requirements, issues, and new feature requests."
}