{
  "kind": "build_request",
  "title": "Support two admin owners (dual-owner admin access)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Update the backend ownership model to support up to two admin owners (two distinct Principals) instead of a single currentOwner, and treat either owner as an admin for all admin-protected operations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add 2 admin owner"
        ]
      },
      "acceptanceCriteria": [
        "Backend persists an owner set/list that can contain 0, 1, or 2 owner Principals.",
        "All existing admin-gated backend methods (e.g., updateSlotSettings, updatePricingRules, blockSlot/unblockSlot, getAllBookings, earnings APIs, etc.) authorize successfully when called by either owner principal.",
        "Non-owners continue to receive an Unauthorized trap for admin-gated backend methods."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add backend APIs to manage the second admin owner: allow an existing owner to add a second owner (by Principal) up to the limit of 2, list current owners, and remove an owner (with safeguards so the last remaining owner cannot remove themselves unless ownership is being fully reset).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add 2 admin owner"
        ]
      },
      "acceptanceCriteria": [
        "There is a backend method to add a second owner that only an existing owner can call, and it traps with a clear English error if the owner limit (2) would be exceeded or if the principal is already an owner.",
        "There is a backend query method to return the current owners as an array/list of Principals (length 0..2).",
        "There is a backend method to remove an owner that only an existing owner can call, and it traps with a clear English error if attempting to remove the last remaining owner (unless ownership is being reset via the emergency reset flow)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update the ownership claim and emergency reset behavior to work correctly with dual owners: initial claim should set the first owner; emergencyResetOwnership must clear all owners and return the system to a claimable state for a new first owner.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add 2 admin owner"
        ]
      },
      "acceptanceCriteria": [
        "When ownership is claimable, claimNewOwnership sets the first owner and makes ownership non-claimable (as it does today), and the caller becomes an admin.",
        "emergencyResetOwnership clears the owners list (both owners if present) and returns the system to an ownership-claimable state.",
        "The emergency reset authorization check remains enforced and uses the existing code value currently configured in backend/main.mo (\"73024141\")."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add an Admin Dashboard UI section for managing admin owners (view current owners, add a second owner, and remove an owner) and wire it to the new backend APIs. All user-facing text must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add 2 admin owner"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard > Settings includes a card/section labeled clearly (e.g., \"Admin Owners\") showing the currently configured owners (0..2) in a readable format (Principal text).",
        "The UI provides an input to add a second owner Principal and shows a success toast/message on success and a clear English error toast/message on failure (including owner-limit reached, invalid principal, not authorized).",
        "The UI provides a remove action for an owner and shows success/error messages; it prevents or clearly errors when attempting to remove the last remaining owner.",
        "Non-admin users cannot access this UI (it remains behind the existing RequireAdmin guard)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update admin login/access-restriction copy that currently implies a single owner (and contains a hardcoded owner email) so that it correctly reflects that there can be up to two admin owners, without hardcoding a specific owner identity in user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add 2 admin owner"
        ]
      },
      "acceptanceCriteria": [
        "AdminLoginPage and any access restricted screens no longer claim there is only one owner/admin.",
        "User-facing text does not hardcode a specific owner email address; it uses generic wording such as \"This area is restricted to admin owners.\"",
        "All updated text is in English and remains clear and consistent with the dual-owner behavior."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing third-party authentication/roles beyond the existing Internet Identity flow.",
    "Adding more than two owners (the requirement is specifically for 2 admin owners).",
    "Adding real-time collaboration or notifications around owner changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}