{
  "kind": "build_request",
  "title": "Make owner reset reliable by adding an atomic reset-and-claim flow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Backend: Add a single-call API that resets admin ownership and immediately assigns ownership to the caller in the same update call, to prevent the situation where the user resets ownership but another Internet Identity claims it first (\"ownership already claimed\").",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Reset again"
        ]
      },
      "acceptanceCriteria": [
        "A new backend update method exists that takes the emergency reset code and, if valid, performs: (1) reset ownership to claimable, then (2) claim ownership for the current caller, then (3) returns success, all in one update call.",
        "If the emergency reset code is invalid, the method traps with an English error message indicating the reset code is invalid.",
        "If the reset-and-claim call succeeds, subsequent calls to the existing isOwnershipClaimable() return false.",
        "After a successful reset-and-claim, the caller is recognized as admin by the backend admin check used by the frontend (useIsCallerAdmin)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Frontend: Update the Admin Login page to support a one-step \"Reset and Claim Ownership\" action (using the entered reset code) for authenticated non-admin users, and redirect to the Admin Dashboard on success.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Reset again"
        ]
      },
      "acceptanceCriteria": [
        "On the /admin-login page, when the user is authenticated and is not admin, the UI provides a primary CTA that performs a one-step reset-and-claim using the reset code input.",
        "On success, show an English success toast/message and navigate to returnTo (if present) or /admin.",
        "On failure, show an English error toast/message with a clear reason (e.g., invalid reset code).",
        "React Query caches related to admin/ownership state are invalidated/refetched after success so the UI reflects the new admin status without requiring a manual refresh."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit any frontend files under frontend/src/components/ui or other paths listed in frontend.immutablePaths.",
    "Do not introduce email/password authentication; Internet Identity remains the only authentication mechanism."
  ],
  "nonGoals": [
    "Adding automatic entry of the reset code without explicit user action (e.g., auto-reading from device/clipboard) unless separately requested.",
    "Implementing third-party authentication providers or wallet-based login.",
    "Changing booking, pricing, slot settings, or earnings features unrelated to owner reset/claim."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}