{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "SportsVilla NXT GEN turf management app (Frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Provide distinct Admin dashboard and Customer booking experiences with clear navigation and routes to switch between them.",
      "acceptanceCriteria": [
        "App provides distinct Admin and Customer sections/pages with consistent layout and navigation.",
        "URLs/routes (or equivalent in-app navigation) exist for both sections."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the app shell and top-level routing for Admin and Customer sections, including a shared layout and navigation links/tabs to switch between them."
        },
        {
          "path": "frontend/src/routes.tsx",
          "operation": "create",
          "description": "Define route constants and route configuration for Admin and Customer sections to keep navigation consistent."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "create",
          "description": "Create a shared layout (header/navbar + content container) used by both Admin and Customer experiences, including navigation controls to switch sections."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "create",
          "description": "Create the Admin Dashboard landing page container that will host Admin modules (settings, calendar, earnings)."
        },
        {
          "path": "frontend/src/pages/customer/CustomerBookingPage.tsx",
          "operation": "create",
          "description": "Create the Customer Booking landing page container that will host date/slot selection and the booking flow."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add Internet Identity login and owner/admin access control UX for Admin pages, blocking non-owners with an English access-restricted message.",
      "acceptanceCriteria": [
        "Admin pages require login via Internet Identity.",
        "Backend enforces owner-only rules for Admin operations (not only frontend hiding).",
        "Non-owner principals cannot call Admin-only update methods successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "create",
          "description": "Add a reusable login/logout button for Internet Identity. Use the selected 'authorization' component guidance for Internet Identity login/logout handling and cache clearing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/RequireAdmin.tsx",
          "operation": "create",
          "description": "Create an Admin route guard that (a) prompts login for anonymous users and (b) checks admin/owner status via backend role queries; show an English Access Restricted screen to non-admin users. Use the selected 'authorization' component guidance for access-control UI patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AccessRestrictedScreen.tsx",
          "operation": "create",
          "description": "Create an English access-restricted screen for blocked Admin access (e.g., explains only the owner can access Admin features)."
        },
        {
          "path": "frontend/src/hooks/useAuthz.ts",
          "operation": "create",
          "description": "Create React Query hooks that fetch caller role/admin status and expose isAuthenticated/isAdmin state for UI guards. Use the selected 'authorization' component guidance for actor dependency and query enabling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the Admin routes through the RequireAdmin guard and ensure the Customer routes remain publicly accessible (no login required unless needed for booking submission)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Provide Admin UI to configure slot settings (opening, closing, slot duration) and reflect them across Admin and Customer views via backend reads.",
      "acceptanceCriteria": [
        "Admin can set opening time, closing time, and slot duration and save changes.",
        "Customer availability and Admin calendar both reflect updated slot settings.",
        "Settings persist across refresh/reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSlotSettings.ts",
          "operation": "create",
          "description": "Create React Query hooks for reading and updating slot settings via the backend actor, including invalidation/refetch after updates."
        },
        {
          "path": "frontend/src/components/admin/SlotSettingsForm.tsx",
          "operation": "create",
          "description": "Build an Admin form to edit opening time, closing time, and slot duration, using composed shadcn/ui inputs/buttons for consistent styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Place SlotSettingsForm into the Admin Dashboard and ensure successful saves trigger refetch for dependent views (calendar and customer availability)."
        },
        {
          "path": "frontend/src/hooks/useAvailability.ts",
          "operation": "create",
          "description": "Create React Query hooks to fetch availability for a selected date and to refetch on dependency changes (slot settings updates, booking/block actions)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Provide Admin UI to configure pricing rules and show computed price in the customer booking summary for a selected slot.",
      "acceptanceCriteria": [
        "Admin can define weekday/weekend base rates and a time-based (morning vs night/floodlight) pricing split.",
        "For any slot time/date, the backend returns a deterministic computed price based on the configured rules.",
        "Customer booking summary shows the computed price for the selected slot before confirmation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePricingRules.ts",
          "operation": "create",
          "description": "Create React Query hooks for reading and updating pricing rules via the backend actor, including invalidation/refetch after updates."
        },
        {
          "path": "frontend/src/components/admin/PricingRulesForm.tsx",
          "operation": "create",
          "description": "Build an Admin form to edit pricing rules (weekday/weekend, floodlight start hour, morning vs floodlight rates), using composed shadcn/ui form controls. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add PricingRulesForm to the Admin Dashboard (e.g., as a settings section/tab) and ensure saves propagate to customer price display via query invalidation."
        },
        {
          "path": "frontend/src/components/customer/BookingSummary.tsx",
          "operation": "create",
          "description": "Create a booking summary panel that displays selected date/time and the computed price derived from backend-provided booking/slot data and/or pricing rules reads (deterministic and consistent with backend computation)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement an Admin calendar/day schedule showing Available/Booked/Blocked slots for a selected date and updating without full reload.",
      "acceptanceCriteria": [
        "Admin can select a date and see a list/grid of all generated slots for that date.",
        "Slots display status: Available / Booked / Blocked.",
        "Calendar view updates after creating or blocking a booking without a full reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminCalendar.ts",
          "operation": "create",
          "description": "Create a derived-calendar hook that combines slot settings, backend availability, bookings, and blocked slots into a single slot-status model for the selected date, suitable for rendering."
        },
        {
          "path": "frontend/src/components/admin/AdminBookingCalendar.tsx",
          "operation": "create",
          "description": "Create the Admin calendar/day schedule UI (grid/list) with slot status chips (Available/Booked/Blocked), using composed shadcn/ui components (cards, buttons, badges). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Wire AdminBookingCalendar into the Admin dashboard and ensure actions (block/unblock/manual entries) trigger React Query invalidation so the calendar updates without a full reload."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Enable Admin manual blocking of one or multiple slots with optional note, reflected as unavailable for customers.",
      "acceptanceCriteria": [
        "Admin can block a specific date+time slot (and optionally multiple contiguous slots) and provide a reason/note.",
        "Blocked slots are displayed in Admin calendar as Blocked.",
        "Customer availability does not show blocked slots as bookable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBlockedSlots.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching blocked slots and performing block/unblock mutations, including invalidation of availability and calendar queries."
        },
        {
          "path": "frontend/src/components/admin/BlockSlotsDialog.tsx",
          "operation": "create",
          "description": "Create an Admin dialog to block a selected slot (and optionally multiple contiguous slots) and capture an optional reason/note, using composed shadcn/ui dialog/input/select components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminBookingCalendar.tsx",
          "operation": "modify",
          "description": "Integrate BlockSlotsDialog actions from the calendar (e.g., block/unblock controls per slot) and refresh UI state via React Query invalidation."
        },
        {
          "path": "frontend/src/components/customer/AvailableSlotsList.tsx",
          "operation": "create",
          "description": "Render customer-facing available slots list sourced from backend availability (which should exclude blocked slots); ensure UI cannot select blocked slots."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Allow customers to select a date and view an up-to-date list of available slots fetched from the backend.",
      "acceptanceCriteria": [
        "Customer can pick a date and see available time slots.",
        "If a slot is booked/blocked from another session, refreshing or re-fetching availability reflects the new state.",
        "Availability data comes from backend queries (not hardcoded)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/customer/CustomerBookingPage.tsx",
          "operation": "modify",
          "description": "Add date selection UI and wire it to availability fetching; include explicit refresh/re-fetch controls and/or polling (per non-goals) using React Query."
        },
        {
          "path": "frontend/src/components/customer/DatePicker.tsx",
          "operation": "create",
          "description": "Create a date picker control (composed from shadcn/ui building blocks where available) that drives availability queries. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAvailability.ts",
          "operation": "modify",
          "description": "Ensure availability query supports manual refetch and optional polling configuration for up-to-date slot lists without WebSockets/push."
        },
        {
          "path": "frontend/src/components/customer/AvailableSlotsList.tsx",
          "operation": "modify",
          "description": "Wire the list to the availability query results and expose slot selection callbacks for the booking flow."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Implement customer booking form (Name, Phone, Sport) and submit booking, showing backend-provided errors for double-booking/blocked slots.",
      "acceptanceCriteria": [
        "Booking form collects Name, Phone Number, and Sport (Football/Cricket) in English UI.",
        "Backend rejects bookings for already-booked/blocked slots, returning a user-displayable error.",
        "Successful booking creates a persisted booking record tied to date+time slot."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBooking.ts",
          "operation": "create",
          "description": "Create React Query mutation hook to submit a booking and handle success/error states; surface user-displayable error messages from backend traps/failures."
        },
        {
          "path": "frontend/src/components/customer/BookingForm.tsx",
          "operation": "create",
          "description": "Create the booking form UI for Name, Phone Number, and Sport (Football/Cricket), using composed shadcn/ui inputs/selects/buttons and English validation messages. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/CustomerBookingPage.tsx",
          "operation": "modify",
          "description": "Wire slot selection + BookingForm submission; on successful booking, proceed to the payment placeholder step before confirmation; on error, display a clear English message and keep the selected slot context."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add a payment placeholder step in the customer booking flow with clear English copy and no real payment processing.",
      "acceptanceCriteria": [
        "Customer flow includes a payment step/screen with placeholder UI and English explanatory copy (e.g., 'Payment integration coming soon').",
        "No external payment APIs are called.",
        "User can proceed to confirmation after acknowledging the placeholder."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/customer/PaymentPlaceholderPage.tsx",
          "operation": "create",
          "description": "Create a dedicated payment placeholder screen that explains payment integration is coming soon and provides an explicit 'Continue' action (no external API calls)."
        },
        {
          "path": "frontend/src/routes.tsx",
          "operation": "modify",
          "description": "Register a route for the payment placeholder step and define navigation helpers used by the booking flow."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the payment placeholder route into the app router and ensure customer flow can navigate to it and onward to confirmation."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Show a booking confirmation receipt with booking ID and details, and provide a receipt lookup view by booking ID.",
      "acceptanceCriteria": [
        "Each booking has a unique booking ID generated by the backend.",
        "Customer sees a confirmation/receipt view immediately after booking with the booking ID and details.",
        "Receipt can be revisited via a dedicated view by entering booking ID (or via a direct link/route if available)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/customer/BookingConfirmationPage.tsx",
          "operation": "create",
          "description": "Create a confirmation/receipt page that reads booking details (including booking ID) and displays date, time, sport, name, phone, and price in a customer-friendly English layout."
        },
        {
          "path": "frontend/src/pages/customer/ReceiptLookupPage.tsx",
          "operation": "create",
          "description": "Create a receipt lookup page where a user can enter a booking ID and fetch/display the receipt details."
        },
        {
          "path": "frontend/src/hooks/useReceipt.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching a booking by ID and mapping it to receipt UI state, including error handling for unknown IDs."
        },
        {
          "path": "frontend/src/routes.tsx",
          "operation": "modify",
          "description": "Add routes for confirmation and receipt lookup (including optional route param for direct receipt links)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the confirmation and receipt lookup routes into the router and ensure the customer flow navigates to confirmation after the payment placeholder step."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add an Admin earnings tracker showing daily and weekly totals with basic date/week filters and updating when bookings change.",
      "acceptanceCriteria": [
        "Admin dashboard shows revenue totals for 'today' and 'this week' (or chosen week).",
        "Totals are computed from persisted bookings using the stored/computed price.",
        "UI updates when new bookings are created."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useEarnings.ts",
          "operation": "create",
          "description": "Create React Query hooks to fetch daily and weekly earnings reports and to refetch when booking-related mutations succeed."
        },
        {
          "path": "frontend/src/components/admin/EarningsTracker.tsx",
          "operation": "create",
          "description": "Create an Admin earnings widget with 'today' and 'this week' totals and simple date/week selectors, using composed shadcn/ui components for consistent UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add EarningsTracker to the Admin dashboard and ensure it updates when new bookings are created (via React Query invalidation/refetch from booking mutation hooks)."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Apply a modern sporty dark theme with neon green accents across Admin and Customer screens using Tailwind and consistent layout/typography.",
      "acceptanceCriteria": [
        "Default appearance is dark mode with neon green accent color used consistently for primary actions and highlights.",
        "Theme is applied across Admin and Customer screens with consistent layout structure.",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Add Tailwind base styles and app-wide theme variables for dark mode with neon green accent; set global typography and spacing defaults consistent with a sporty theme."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Apply consistent container spacing, header styling, and primary action styling aligned with the dark/neon theme across Admin and Customer sections."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme tokens (colors/gradients/shadows) as needed to support neon green accent usage consistently across the app."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add generated SportsVilla brand assets as static frontend assets, display logo in header, set favicon, and optionally use background pattern in UI.",
      "acceptanceCriteria": [
        "Generated images are added under frontend/public/assets/generated/ and referenced directly from the frontend.",
        "App header/navbar displays the generated logo image.",
        "Favicon is set to the generated favicon image."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/sportsvilla-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated logo image asset as a static public file."
        },
        {
          "path": "frontend/public/assets/generated/sportsvilla-appicon.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated app icon image asset as a static public file."
        },
        {
          "path": "frontend/public/assets/generated/sportsvilla-favicon.dim_64x64.png",
          "operation": "create",
          "description": "Add the generated favicon image asset as a static public file."
        },
        {
          "path": "frontend/public/assets/generated/sportsvilla-bg-pattern.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated subtle background pattern image asset as a static public file."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Set the favicon link to frontend/public/assets/generated/sportsvilla-favicon.dim_64x64.png and update the document title to match SportsVilla NXT GEN branding."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Display frontend/public/assets/generated/sportsvilla-logo.dim_512x512.png in the header/navbar and apply the background pattern frontend/public/assets/generated/sportsvilla-bg-pattern.dim_1920x1080.png as a subtle app backdrop."
        }
      ]
    }
  ]
}