{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend: Admin Login one-step Reset-and-Claim Ownership",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Update Admin Login to support a one-step reset-and-claim ownership action for authenticated non-admin users, with success redirect and cache invalidation.",
      "acceptanceCriteria": [
        "On the /admin-login page, when the user is authenticated and is not admin, the UI provides a primary CTA that performs a one-step reset-and-claim using the reset code input.",
        "On success, show an English success toast/message and navigate to returnTo (if present) or /admin.",
        "On failure, show an English error toast/message with a clear reason (e.g., invalid reset code).",
        "React Query caches related to admin/ownership state are invalidated/refetched after success so the UI reflects the new admin status without requiring a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook for the atomic reset-and-claim flow that calls the backend capability for reset-and-claim (using the user-entered reset code) and, on success, invalidates/refetches ownership/admin-related caches (at minimum: ['isCallerAdmin'], ['ownershipClaimable']). Ensure errors are surfaced as clear English messages suitable for toasts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Update the authenticated non-admin UI to offer a single primary CTA labeled \"Reset and Claim Ownership\" that uses the reset code input and triggers the new reset-and-claim mutation. On success, show an English success toast and navigate to returnTo (if present) or /admin; on failure, show an English error toast. After success, ensure the UI updates without manual refresh by relying on query invalidation and/or explicit refetch of admin/ownership queries. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend type declarations (as needed) so the reset-and-claim backend function signature matches the new API used by the Admin Login page (including passing the reset code), preventing type errors and ensuring the mutation can call the backend capability from TypeScript."
        }
      ]
    }
  ]
}