{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dual-owner admin management UI",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Add an Admin Dashboard Settings section to view/add/remove admin owners and connect it to backend owner-management capabilities.",
      "acceptanceCriteria": [
        "Admin Dashboard > Settings includes a clearly labeled \"Admin Owners\" section showing the current owners (0..2) as Principal text.",
        "Admins can add a second owner Principal and see a success message on success and clear English error messages on failure (including owner-limit reached, invalid principal, not authorized).",
        "Admins can remove an owner and see success/error messages; the UI prevents or clearly errors when attempting to remove the last remaining owner.",
        "Non-admin users cannot access this UI (remains behind the existing RequireAdmin guard)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks/mutations for owner management using the backend actor capabilities already exposed in types (getOwners, addOwner, removeOwner). Ensure queries invalidate/refetch appropriately after add/remove, and normalize trap errors into clear English UI-ready messages. Use patterns consistent with the existing authorization flow; verify the selected \"authorization\" component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminOwnersCard.tsx",
          "operation": "create",
          "description": "Create an Admin Owners card/section UI for the Admin Dashboard Settings tab: fetch and display current owners (0..2) in a readable list; provide an input to add a new owner by Principal text and a remove action per owner. Validate Principal input client-side (parse + show 'Invalid Principal' before submitting) and surface success/error toasts/messages in English. Keep the section suitable for admin-only viewing; verify the selected \"authorization\" component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Wire the new AdminOwnersCard into the Settings tab (\"Admin Dashboard > Settings\") alongside existing settings cards, ensuring it is reachable without adding new routes. Verify the selected \"authorization\" component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update admin access/login copy to reflect up to two admin owners and remove hardcoded owner identity details.",
      "acceptanceCriteria": [
        "AdminLoginPage and any access restricted screens no longer claim there is only one owner/admin.",
        "User-facing text does not hardcode a specific owner email address; it uses generic wording such as \"This area is restricted to admin owners.\"",
        "All updated text is in English and remains clear and consistent with the dual-owner behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded single-owner language and the embedded owner email with generic English wording that supports up to two admin owners (e.g., 'restricted to admin owners'). Ensure both the unauthenticated login screen and the authenticated-but-not-admin restricted screen use the updated copy. Verify the selected \"authorization\" component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AccessRestrictedScreen.tsx",
          "operation": "modify",
          "description": "Update the access restricted message to remove the hardcoded owner email and any single-owner implication; use generic English wording consistent with up to two admin owners. Verify the selected \"authorization\" component's usage instructions before implementing."
        }
      ]
    }
  ]
}